app/services/video_generator_service.rb

UPDATE "clips" SET "generation_progress" = $1 WHERE "clips"."id" = $2  [["generation_progress", 43], ["id", 6]]
---
  def run_ffmpeg(cmd)
    require "open3"

    # Inject -progress pipe:1 just before the output path (last element)
    cmd_with_progress = cmd[0..-2] + ["-progress", "pipe:1", cmd.last]
    total_ms = @clip.duration * 1_000_000  # microseconds

    exit_status = nil
    Open3.popen3(*cmd_with_progress) do |_stdin, stdout, _stderr, wait_thr|
      stdout.each_line do |line|
        next unless line.start_with?("out_time_us=")
        out_us = line.split("=").last.strip.to_i
        next if out_us <= 0 || total_ms <= 0
        pct = (20 + (out_us.to_f / total_ms * 75)).clamp(20, 95).round
        @clip.update_column(:generation_progress, pct)