app/views/dashboard/index.html.erb

        <div class="text-gray-400 text-sm">
          <%= current_user.social_accounts.count %> / 3 platforms connected
---
SELECT COUNT(*) FROM "social_accounts" WHERE "social_accounts"."user_id" = $1  [["user_id", 1]]

        <div class="font-semibold text-white text-lg">My Clips</div>
        <div class="text-gray-400 text-sm"><%= current_user.clips.count %> reels created</div>
---
SELECT COUNT(*) FROM "clips" WHERE "clips"."user_id" = $1  [["user_id", 1]]