app/views/clips/show.html.erb

SELECT 1 AS one FROM "social_accounts" WHERE "social_accounts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

        <% unless current_user.social_accounts.any? %>