app/views/admin/dashboard.html.erb

SELECT "clips".* FROM "clips" WHERE "clips"."status" = $1 ORDER BY "clips"."updated_at" ASC  [["status", "processing"]]
---
      <div class="space-y-2">
        <% Clip::STATUSES.each do |status| %>

SELECT COUNT(*) FROM "soundtracks" WHERE "soundtracks"."global" = $1  [["global", true]]
---
          <span class="text-gray-400">Soundtracks</span>
          <span class="text-white"><%= @stats[:soundtracks] %> (<%= Soundtrack.global.count %> default)</span>

UPDATE "clips" SET "status" = $1, "updated_at" = $2 WHERE "clips"."id" = $3  [["status", "processing"], ["updated_at", "2026-04-11 10:15:10.182229"], ["id", 3]]
---
              <div class="text-gray-500 text-xs mt-0.5 ml-4">
                <%= clip.user.email %> · running for <%= time_ago_in_words(clip.updated_at) %>