app/controllers/admin_controller.rb

  def dashboard
    @stats = {
      users:            User.count,
      clips:            Clip.count,
      clips_by_status:  Clip.group(:status).count,
      soundtracks:      Soundtrack.count,
      ready_clips:      Clip.where(status: "ready").count,
      failed_clips:     Clip.where(status: "failed").count,
      processing_clips: Clip.where(status: "processing").count
    }
    @recent_clips      = Clip.includes(:user).order(created_at: :desc).limit(10)
---
SELECT "clips".* FROM "clips" WHERE "clips"."status" = $1 ORDER BY "clips"."updated_at" ASC  [["status", "processing"]]
SELECT COUNT(*) FROM "clips" WHERE "clips"."status" = $1  [["status", "processing"]]
SELECT "clips".* FROM "clips" ORDER BY "clips"."created_at" DESC LIMIT $1  [["LIMIT", 10]]

  def stop_clip
    if params[:bulk]
      clips = Clip.where(status: "processing")
      count = clips.count
      clips.update_all(status: "failed", error_message: "Stopped by admin")
      redirect_to admin_dashboard_path, notice: "#{count} processing clip#{"s" if count != 1} stopped."
    else
      @clip.mark_failed!("Stopped by admin")
      if params[:retry]
        @clip.update!(status: "pending", error_message: nil)
---
SELECT COUNT(*) AS "count_all", "clips"."status" AS "clips_status" FROM "clips" GROUP BY "clips"."status"
UPDATE "clips" SET "status" = $1, "error_message" = $2, "updated_at" = $3 WHERE "clips"."id" = $4  [["status", "failed"], ["error_message", "Stopped by admin"], ["updated_at", "2026-04-11 10:12:49.327311"], ["id", 1]]
UPDATE "clips" SET "status" = $1, "error_message" = $2, "updated_at" = $3 WHERE "clips"."id" = $4  [["status", "pending"], ["error_message", nil], ["updated_at", "2026-04-11 10:15:10.159459"], ["id", 3]]

  def retry_clip
    if params[:bulk]
      clips = Clip.where(status: "failed")
      clips.each do |clip|
        clip.update!(status: "pending", error_message: nil)
        GenerateClipJob.perform_later(clip.id)
      end
      redirect_to admin_dashboard_path, notice: "#{clips.size} clips re-queued."
    else
      @clip.update!(status: "pending", error_message: nil)
---
UPDATE "clips" SET "status" = $1, "error_message" = $2, "updated_at" = $3 WHERE "clips"."id" = $4  [["status", "pending"], ["error_message", nil], ["updated_at", "2026-04-11 10:14:02.026714"], ["id", 3]]

  def destroy_clip
    title = @clip.title
    @clip.video.purge if @clip.video.attached?
    @clip.images.purge
    @clip.destroy
---
DELETE FROM "clips" WHERE "clips"."id" = $1  [["id", 1]]

  def set_clip
    @clip = Clip.find(params[:id])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]