app/controllers/clips_controller.rb

INSERT INTO "clips" ("user_id", "title", "description", "status", "duration", "transition_effect", "ai_caption", "ai_hashtags", "upload_results", "error_message", "created_at", "updated_at", "soundtrack_id", "generation_progress") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @clip = current_user.clips.new(clip_params)

    if @clip.save

SELECT "clips".* FROM "clips" WHERE "clips"."user_id" = $1 AND "clips"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
---
  def set_clip
    @clip = current_user.clips.find(params[:id])