app/controllers/dashboard_controller.rb

SELECT "clips".* FROM "clips" WHERE "clips"."user_id" = $1 ORDER BY "clips"."created_at" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 10]]
---
  def index
    @clips = current_user.clips.recent.limit(10)