app/controllers/soundtracks_controller.rb

  def set_soundtrack
    # Allow destroy only on user-owned or global (but we block global above)
    @soundtrack = Soundtrack.for_user(current_user).find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]