app/jobs/generate_clip_job.rb

  def perform(clip_id)
    clip = Clip.find(clip_id)
    return unless clip.pending? || clip.failed?

    clip.mark_processing!

    # Generate AI caption first
    begin
      result = OllamaService.generate_caption_and_hashtags(clip.title, clip.description)
      clip.update!(ai_caption: result[:caption], ai_hashtags: result[:hashtags])
---
SELECT "clips".* FROM "clips" WHERE "clips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "clips" SET "ai_caption" = $1, "ai_hashtags" = $2, "updated_at" = $3 WHERE "clips"."id" = $4